# running in /home/fuqizhang/formal_verification/riscv-formal-yosys/riscv-formal/cores/e203_hbirdv2/checks/insn_and_ch0/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
